artillery/config.yaml
config:
  target: '{{ $env.TEST_SITE_URL }}'
  tls:
    rejectUnauthorized: false
  # Load the Playwright engine:
  engines:
    playwright:
      contextOptions:
        ignoreHTTPSErrors: true
        storageState:
          origins:
          - origin: '{{ $env.TEST_SITE_URL }}'
            localStorage:
            - name: API_HOST
              value: '{{ $env.API_HOST }}'
  processor: './test-functions.js'
  phases:
  - name: create_sql_data
    duration: 30
    arrivalRate: 3
    scenarios:
    - write1SQLBackedUpdatePerSecond
  - name: query_sql_data
    duration: 30
    arrivalRate: 3
    scenarios:
    - querySQLBackedScope
scenarios:
- name: write1SQLBackedUpdatePerSecond
  engine: playwright
  testFunction: proxy
- name: querySQLBackedScope
  engine: playwright
  testFunction: proxy